#include "menu.hpp"

/// Тук програмата се стартира
///
/// При началото на програмата, излиза първото меню. То има три опции. Първата е да се създаде нов потребител.
/// При избирането на тази опция, то потребителят трябва да въведе потребителско име, парола и имейл адрес за регистрация.
/// При неуспешна регистрация, излиза подходящо съобщение, което съобщава каква е била грешката при регистрацията.
/// След успешна или неуспешна регистрация, програмата отново връща потребителя в началото на първото меню.
/// Втората опция на първото меню е да се влезне във вече създаден профил. Програмата ще изисква от потребителя да въведе
/// потребителско име и парола. Ако не съществува такъв профил, то програмата ще изведе подходящо съобщение за невалидно
/// въведени данни и ще изпрати потребителя в началото на първото меню. При правилно въведени данни, програмата ще отвори
/// своето второ меню
/// Третата опция на първото меню е програмата да приключи
///
/// Второто меню отново съдържа три опции. Първата е да се добави ново пътуване във файла на съответния потребител.
/// Програмата ще изисква от потребителя да въведе дестинация, период, оценка, коментар и множество от снимки на пътуването.
/// При невалидно въведени данни, програмата ще изведе подходящо съобщение и ще върне потребителя в началото на второто меню.
/// Втората опция е да се провери дадена дестинация. Потребителят трябва да въведе името на дестинацията, след което програмата
/// ще изведе информация за всички регистрирани пътувания за тази дестинация от всички потребители, както и средната оценка на 
/// всички пътувания. Ако нито един потребител не е регистрирал пътуване до тази дестинация, то програмата извежда съобщение за това
/// Третата опция е програмата да приключи
int main()
{
    Menu::start().menuSecond(Menu::start().menuFirst());

    return 0;
}
